Revit 2027 API
BuiltInFailures.FormFailures.FormElemRegenSelfIntersectionResetConnections Property
 This form cannot be created due to self-intersecting geometry. Clicking the Reset Connections button will attempt to solve this problem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FormElemRegenSelfIntersectionResetConnections { get; }
Public Shared ReadOnly Property FormElemRegenSelfIntersectionResetConnections As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FormElemRegenSelfIntersectionResetConnections {
	FailureDefinitionId^ get ();
}
static member FormElemRegenSelfIntersectionResetConnections : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FormFailures Class
Autodesk.Revit.DB Namespace